Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC00/svd/PIC32CK0512GC00100.svd
            <register>
               <name>VREGCTRL</name>
               <description>VREG Control</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>VREGOUT</name>
                     <description>VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>VREGOUTSelect</name>
                        <enumeratedValue>
                           <name>1p2v</name>
                           <description>In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.2v.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1p0v</name>
                           <description>In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 1.0v.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0p8v</name>
                           <description>In Active mode, VDDCORE_RAM, VDDCORE_BU, VDDCORE_SW and optionnaly VDDCORE_PLL USB are set to 0.8v.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>OFFSTDBY</name>
                     <description>Off in Standby Control for VREGSW[N-1]. Useful for Riverside only.</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>OFFSTDBYSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>In standby mode, VREGSW1,2,3 are OFF</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>In standby mode, VREGSW1,2,3 are ON</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LVSTDBY</name>
                     <description>Low Voltage Standby Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LVSTDBYSelect</name>
                        <enumeratedValue>
                           <name>1p2v</name>
                           <description>In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 1.2v.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0p8v</name>
                           <description>In standby mode, VDDCORE_BU, VDDCORE_RAM, VDDCORE_SW and optionnaly VDDCOREUSB/PLL are set to 0.8v.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LVHIB</name>
                     <description>Low Voltage Hibernate Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LVHIBSelect</name>
                        <enumeratedValue>
                           <name>1p2v</name>
                           <description>In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 1.2v.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0p8v</name>
                           <description>In Hibernate mode, VDDCORE_BU and VDDCORE_RAM are set to 0.8v</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SCAPEN</name>
                     <description>Super Capacitor Charging Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPEN</name>
                     <description>Charge Pump Enable and Auto-enable.</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>ULDOEN</name>
                     <description>User LDO Voltage Regulator Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ULDOSTDBY</name>
                     <description>User LDO Voltage Regulator Configuration</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ULDOSTDBYSelect</name>
                        <enumeratedValue>
                           <name>OFFINSTDBY</name>
                           <description>Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONINSTDBY</name>
                           <description>Regulator is ON in Standby mode. is OFF from Hibernate mode. It is OFF in backup mode as well.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ULDOLEVEL</name>
                     <description>User LDO Voltage Level Selection</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ULDOLEVELSelect</name>
                        <enumeratedValue>
                           <name>1p2v</name>
                           <description>Vout = 1.2v</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1p5v</name>
                           <description>Vout = 1.5v</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1p8v</name>
                           <description>Vout = 1.8v</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2p5v</name>
                           <description>Vout = 2.5v</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AVREGEN</name>
                     <description>Additional Voltage Regulator Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AVREGSTDBY</name>
                     <description>Additional Voltage Regulator Configuration</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>AVREGSTDBYSelect</name>
                        <enumeratedValue>
                           <name>OFFINSTDBY</name>
                           <description>Regulator is OFF while in sleep mode equal or deeper than standby mode. It is OFF in hibernate and backup mode as well.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ONINSTDBY</name>
                           <description>Regulator is ON in Standby mode if AVREGEN bit is set. is OFF from Hibernate mode. It is OFF in backup mode as well.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>VREFCTRL</name>
               <description>VREF Control</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000003</resetValue>
               <fields>
                  <field>
                     <name>LPSTDBY</name>
                     <description>Bandgap and Regulators Low Power Standby Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPSTDBYSelect</name>
                        <enumeratedValue>
                           <name>FullPower</name>
                           <description>In standby mode, bandgap and enabled regulator(s) are set to nominal power mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LowPower</name>
                           <description>In standby mode, bandgap and enabled regulator(s) are set to low power mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPHIB</name>
                     <description>Bandgap and Regulators Low Power Hibernate Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPHIBSelect</name>
                        <enumeratedValue>
                           <name>FullPower</name>
                           <description>In hibernate mode, bandgap is set to nominal power mode. As a consequence, enabled regulator(s) are set to nominal power mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LowPower</name>
                           <description>In hibernate mode, bandgap is set to low power mode. As a consequence, enabled regulator(s) are set to low power mode.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TSEN</name>
                     <description>Temperature Sensor Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BBPS</name>
               <description>Battery Backup Power Switch. This register is implemented only if SUPC_VBAT_IMPLEMENTED==1</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CONF</name>
                     <description>Battery Backup Power Switch Configuration</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CONFSelect</name>
                        <enumeratedValue>
                           <name>BOR</name>
                           <description>The power switch is automatically handled by the BOR</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VBAT</name>
                           <description>In Backup mode, the power-switch is forced to VBAT.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKONVBATEN</name>
                     <description>Wake on VBAT Enable, from Backup mode</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEEN</name>
                     <description>Wake Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WAKEENSelect</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>When exiting battery backup mode, the device goes to backup mode.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EN</name>
                           <description>When exiting battery backup mode, the device is waken-up.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENVBATMON</name>
                     <description>Enables battery monitor</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SELVBATMON</name>
                     <description>Select VBATMON supply voltage. 0 for VDDA, and 1 for VDDBAT.</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKOUT</name>
               <description>Backup Output Control</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EN0</name>
                     <description>Enable Output</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EN1</name>
                     <description>Enable Output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLR0</name>
                     <description>Clear Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLR1</name>
                     <description>Clear Output</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET0</name>
                     <description>Set Output</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SET1</name>
                     <description>Set Output</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TGLOM0</name>
                     <description>Toggle Output Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TGLOM0Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The output does not toggle.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RTCTGL</name>
                           <description>The output toggles on RTC event.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BKUPTGL</name>
                           <description>The output is set when the device enters backup mode or battery backup mode. The output should then be cleared by software.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TGLOM1</name>
                     <description>Toggle Output Mode</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TGLOM1Select</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The output does not toggle.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RTCTGL</name>
                           <description>The output toggles on RTC event.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BKUPTGL</name>
                           <description>The output is set when the device enters backup mode or battery backup mode. The output should then be cleared by software.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>BKIN</name>
               <description>Backup Input Control</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BKIN</name>
                     <description>Backup Input Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
